ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap_central.h
/*******************************************************************************
* \file cy_ble_stack_gap_central.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs of Generic Access Profile - Central Role.
*  Also specified the defines, constants, and data structures required for the APIs.
*
*
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
*
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/
#ifndef CY_BLE_STACK_GAP_CENTRAL_H_
#define CY_BLE_STACK_GAP_CENTRAL_H_

/***************************************
* Common stack includes
***************************************/

#include "cy_ble_stack_gap.h"


/***************************************
** GAP Constants
***************************************/

/** Observation and discovery procedure */
#define CY_BLE_GAPC_OBSER_PROCEDURE              0x00u /**< Observation procedure */
#define CY_BLE_GAPC_LTD_DISC_PROCEDURE           0x01u /**< Limited discovery procedure */
#define CY_BLE_GAPC_GEN_DISC_PROCEDURE           0x02u /**< General discovery procedure */

/** Type of discovery procedure use in cy_stc_ble_gapc_disc_info_t*/
#define CY_BLE_GAPC_PASSIVE_SCANNING             0x00u /**< passive scan */
#define CY_BLE_GAPC_ACTIVE_SCANNING              0x01u /**< active scan */
#define CY_BLE_GAPC_FILTER_DUP_DISABLE           0x00u /**< Filter duplicate disable */
#define CY_BLE_GAPC_FILTER_DUP_ENABLE            0x01u /**< Filter duplicate enable */

/** Scan filter policy */

/** Accept all advertisement packets except directed advertising packets not
  * addressed to this device
  */
#define CY_BLE_GAPC_ADV_ACCEPT_ALL_PKT                       0x00u

/** Accept only advertisement packets from devices where the advertiser's address
  * is in the whitelist.  Directed advertising packets that are not addressed for
  * this device shall be ignored.
  */
#define CY_BLE_GAPC_ADV_ACCEPT_WHITELIST_PKT                 0x01u

/** Accept all undirected advertisement packets, and directed advertising packets
  * where the initiator address is a resolvable private address, and directed advertising
  * packets addressed to this device.
  */
#define CY_BLE_GAPC_ADV_ACCEPT_DIRECTED_RPA_PKT              0x02u

/** Accept all advertisement packets from devices where the advertiser's address
  * is in the whitelist, and directed advertising packets where the initiator address
  * is a resolvable private address, and directed advertising packets addressed
  * to this device.
  */
#define CY_BLE_GAPC_ADV_ACCEPT_WHITELIST_DIRECTED_RPA_PKT    0x03u

/** Initiator filter policy*/
#define CY_BLE_GAPC_CONN_ALL                     0x00u /**< Filter policy- connect all */
#define CY_BLE_GAPC_CONN_WHITELIST               0x01u /**< Filter policy- connect only from whitelist */

/**
 \addtogroup group_ble_common_api_gap_definitions
 @{
*/

/***************************************
** Enumerated Types
***************************************/

/** Advertisement event type  */
typedef enum
{
    /** Connectable undirected advertising */
    CY_BLE_GAPC_CONN_UNDIRECTED_ADV = 0x00u,

    /** Connectable directed advertising */
    CY_BLE_GAPC_CONN_DIRECTED_ADV,

    /** Scannable undirected advertising */
    CY_BLE_GAPC_SCAN_UNDIRECTED_ADV,

    /** Non connectable undirected advertising */
    CY_BLE_GAPC_NON_CONN_UNDIRECTED_ADV,

    /** Scan Response*/
    CY_BLE_GAPC_SCAN_RSP

}cy_en_ble_gapc_adv_event_t;

/***************************************
** Exported structures and unions
***************************************/

/** Discovery (scan) parameter  */
typedef struct
{
    /** Observation and discovery procedure.
         - CY_BLE_GAPC_OBSER_PROCEDURE (Observation procedure)
         - CY_BLE_GAPC_LTD_DISC_PROCEDURE (Limited discovery procedure)
         - CY_BLE_GAPC_GEN_DISC_PROCEDURE (General discovery procedure)
     */
    uint8_t      discProcedure;

    /** Type of scan to perform
         - CY_BLE_GAPC_PASSIVE_SCANNING (Passive Scanning)
         - CY_BLE_GAPC_ACTIVE_SCANNING (Active scanning)
     */
    uint8_t      scanType;

    /** The time interval from when last LE scan is started until
       next subsequent LE scan.
        - Time Range: 2.5 ms to 10.24 sec.
     */
    uint16_t     scanIntv;

    /** The time duration of scanning to be performed
        - Time Range: 2.5 ms to 10.24 sec
     */
    uint16_t     scanWindow;

    /** Own BD Address Type
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC
        - CY_BLE_GAP_ADDR_TYPE_RANDOM
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA
        - CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA
     */
    uint8_t      ownAddrType;

    /** Filter policies to be applied during scanning procedure
        - CY_BLE_GAPC_ADV_ACCEPT_ALL_PKT
        - CY_BLE_GAPC_ADV_ACCEPT_WHITELIST_PKT
        - CY_BLE_GAPC_ADV_ACCEPT_DIRECTED_RPA_PKT
        - CY_BLE_GAPC_ADV_ACCEPT_WHITELIST_DIRECTED_RPA_PKT
     */
    uint8_t      scanFilterPolicy;

    /** Scan timeout. Timeout is in seconds and none are zero.
       If timeout is set as 0, then there will not be any timeout.
       scanTo can be used for all GAP timeouts related to Central operation.
     */
    uint16_t     scanTo;

    /** Filter Duplicate Advertisement. The Filter Duplicates parameter controls whether
       the Link Layer shall filter duplicate advertising reports to the Host, or whether the
       Link Layer should generate advertising reports for each packet received.
        - CY_BLE_GAPC_FILTER_DUP_DISABLE (Duplicate filtering disabled)
        - CY_BLE_GAPC_FILTER_DUP_ENABLE (Duplicate filtering enabled)

       By default, duplicate filtering is enabled
     */
    uint8_t      filterDuplicates;

} cy_stc_ble_gapc_disc_info_t;

