ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap_central.h
/** Connection parameter */
typedef struct
{
    /** The time interval from when last LE scan is started until next
       subsequent LE scan.
        - Time Range: 2.5 ms to 10.24 sec.
     */
    uint16_t      scanIntv;

    /** The time duration of scanning to be performed
        - Time Range: 2.5 ms to 10.24 sec
     */
    uint16_t      scanWindow;

    /** Filter policies to be applied during connection procedure
        - CY_BLE_GAPC_CONN_ALL (Whitelist is not used to determine with
        which advertiser to connect. Peer address is used)
        - CY_BLE_GAPC_CONN_WHITELIST (Whitelist is used to determine with
        which advertiser to connect. Peer address shall be ignored)
     */
    uint8_t       initiatorFilterPolicy;

    /** Peer's bd address with whom connection to be established */
    uint8_t       peerBdAddr[CY_BLE_GAP_BD_ADDR_SIZE];

    /** Peer's bd address type
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC
        - CY_BLE_GAP_ADDR_TYPE_RANDOM
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA
        - CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA
     */
    uint8_t       peerAddrType;

    /** Own bd address type
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC
        - CY_BLE_GAP_ADDR_TYPE_RANDOM
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA
        - CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA
    */
    uint8_t       ownAddrType;

    /** Minimum value for the connection event interval. This shall be less than
       or equal to conn_Interval_Max. Minimum connection interval will be
         connIntvMin * 1.25 ms
        * Time Range: 7.5 ms to 4 sec
     */
    uint16_t      connIntvMin;

    /** Maximum value for the connection event interval. This shall be greater
       than or equal to conn_Interval_Min. Maximum connection interval will be
         connIntvMax * 1.25 ms
        * Time Range: 7.5 ms to 4 sec
     */
    uint16_t      connIntvMax;

    /** Slave latency for the connection in number of connection events.
        * Range: 0x0000 to 0x01F3
     */
    uint16_t      connLatency;

    /** Supervision timeout for the LE Link. Supervision timeout will be
       supervisionTO * 10 ms
        * Time Range: 100 msec to 32 secs
     */
    uint16_t      supervisionTO;

    /** Minimum length of connection needed for this LE connection.
        * Range: 0x0000 - 0xFFFF
     */
    uint16_t      minCeLength;

    /** Maximum length of connection needed for this LE connection.
        * Range: 0x0000 - 0xFFFF
     */
    uint16_t      maxCeLength;

}cy_stc_ble_gapc_conn_info_t;

/** Resolve peer device parameter  */
typedef struct
{
    /** Peer Bluetooth device address */
    uint8_t      * bdAddr;

    /** Peer IRK */
    uint8_t       peerIrk[CY_BLE_GAP_SMP_IRK_SIZE];

}cy_stc_ble_gapc_resolve_peer_info_t;

/** Set peer BD Address parameter  */
typedef struct
{
    /** Peer Bluetooth device address */
    cy_stc_ble_gap_bd_addr_t  remoteAddr;

    /** Peer bdHandle */
    uint8_t                bdHandle;

}cy_stc_ble_gapc_peer_bd_addr_info_t;


/* --------------------------Structure corresponding to events-------------------- */

/** Advertisement report parameter */
typedef struct
{
    /** Advertisement event type
        - Connectable undirected advertising = 0x00
        - Connectable directed advertising = 0x01
        - Scannable undirected advertising = 0x02
        - Non connectable undirected advertising = 0x03
        - Scan Response = 0x04
     */
    cy_en_ble_gapc_adv_event_t      eventType;

    /** bd address type of the device advertising.
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC
        - CY_BLE_GAP_ADDR_TYPE_RANDOM
        - CY_BLE_GAP_ADDR_TYPE_PUBLIC_RPA
        - CY_BLE_GAP_ADDR_TYPE_RANDOM_RPA
    */
    uint8_t                       peerAddrType;

    /** Public Device Address or Random Device Address for
       each device that responded to scanning. */
    uint8_t*                      peerBdAddr;

    /** length of the data for each device that responded to scanning */
    uint8_t                       dataLen;

    /** Pointer to advertising or scan response data */
    uint8_t*                      data;

    /** Rssi of the responding device.
                 * Range: -85 <= N <= 0
                 * Units: dBm */
    int8_t                        rssi;

} cy_stc_ble_gapc_adv_report_param_t;

/** Direct Advertising Report received by GAP Central */
typedef struct
{
    /** Buffer containing Random Device Address of Scanner (local device)
     * This is the address to which the directed advertisements are
     * being directed.
     */
    uint8_t                       * localBdAddr;

    /** Buffer containing Device Address of advertiser sending the directed advertisement */
    uint8_t                       * peerBdAddr;

    /** Device Address type of advertiser sending the directed advertisement */
    cy_en_ble_gap_adv_addr_type_t   peerBdAddrType;


    /** Rssi of the responding device.
     * Range: -127 <= N <= +20
     * Units: dBm
     * N = 127 -> RSSI not available
     */
    int8_t                        rssi;

} cy_stc_ble_gapc_direct_adv_report_param_t;
/** @} */



/***************************************
** Exported APIs
***************************************/
/**
 \addtogroup group_ble_common_api_gap_central_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_GAPC_StartDiscovery
***************************************************************************//**
*
*  This function starts the discovery of devices that are advertising. This is a
*  non-blocking function. As soon as the discovery operation starts, the
*  CY_BLE_EVT_GAPC_SCAN_START_STOP event is generated.
*
*  Every Advertisement / Scan response packet received results in a new event,
*  CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT. If 'scanInfo->scanTo' is a non-zero value,
*  upon commencement of discovery procedure and elapsed time = 'scanInfo->scanTo',
*  CY_BLE_EVT_TIMEOUT event is generated with the event parameter indicating
*  CY_BLE_GAP_SCAN_TO.
*
*  If 'param->scanTo' is equal to zero, the scanning operation is performed
*  until the Cy_BLE_GAPC_StopDiscovery() function is invoked.
*  
*  If 'param->scanFilterPolicy' is set to 0x02 or 0x03, CY_BLE_EVT_GAPC_DIRECT_ADV_REPORT event
*  is received to indicate that directed advertisements have been received where 
*  the advertiser is using a resolvable private address.
*
*  There are three discovery procedures that can be specified as a parameter to
*  this function.
*
*  __Observation procedure__

*   A device performing the observer role receives only advertisement data from
*   devices irrespective of their discoverable mode settings. Advertisement data
*   received is provided by the event,
*
*   CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT
*
*   'param->scanType' should be set as passive scanning (0x00).
*
*  __Limited Discovery procedure__

*   A device performing the limited discovery procedure receives advertisement
*   data and scan response data from devices in the limited discoverable mode only.
*   Received data is provided by the event,
*
*   CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT
*
*   'param->scanType' should be set as active scanning (0x01).
*
*  __General Discovery procedure__

*   A device performing the general discovery procedure receives the advertisement
*   data and scan response data from devices in both limited discoverable mode and
*   general discoverable mode. Received data is provided by the event,
*
*   CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT
*
*   'param->scanType' should be set as active scanning (0x01).
*
*   \param param:  Pointer to a variable of type cy_stc_ble_gapc_disc_info_t
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter for 'param' or if any element within 'param' has an invalid value.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_StartDiscovery
(
    cy_stc_ble_gapc_disc_info_t  * param
);


