ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap_central.h
/******************************************************************************
* Function Name: Cy_BLE_GAPC_StopDiscovery
***************************************************************************//**
*
*  This function stops the discovery of devices. This is a non-blocking function.
*  On stopping discovery operation, the CY_BLE_EVT_GAPC_SCAN_START_STOP event is
*  generated. Application layer must keep track of the function call made
*  before receiving this event to associate this event with either the start or
*  stop discovery function.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_StopDiscovery
(
    void
);


/******************************************************************************
* Function Name: Cy_BLE_GAPC_InitConnection
***************************************************************************//**
*  This function instructs the BLE Stack to initiate a connection request to the
*  remote device with required connection parameters. The connection request from
*  the application is acknowledged by the BLE Controller as
*  'CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE' or 'CY_BLE_EVT_GAP_DEVICE_CONNECTED'
*  depending on whether Link Layer Privacy is enabled or not in the component customizer. That
*  means, a request is correct, permitted, and  all parameters that are part of the
*  request are correct. If the parameter validation or request is not permitted,
*  then the BLE controller throws the 'CY_BLE_EVT_GAP_DEVICE_CONNECTED' event with error code in the status,
*  instead of CY_BLE_EVT_GAP_DEVICE_CONNECTED/CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE.
*  For a positive condition, the controller can issue a connect request to a peer. If it fails to establish
*  connection, 'CY_BLE_EVT_GAP_DEVICE_DISCONNECTED' is passed to application.
*  Once connection is established, CY_BLE_EVT_GAP_CONN_ESTB will be sent to the application
*  if the application has set the CY_BLE_CONN_ESTB_EVENT_MASK event mask using Cy_BLE_SetCustomEventMask().
*  The stack supports creating only one master connection at a time. 
*
*  This API should not be called until the previous call to the API has resulted in a connection
*  completion as indicated by the event CY_BLE_EVT_GAP_DEVICE_CONNECTED/
*  CY_BLE_EVT_GAP_DEVICE_CONNECTEDCY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE  Or
*  Cy_BLE_GAPC_CancelConnection() is not yet completed, which is informed through 
*  event 'CY_BLE_EVT_GAP_CREATE_CONN_CANCEL_COMPLETE'
*
*  The CY_BLE_EVT_GATT_CONNECT_IND event is generated at the GAP Peripheral end after connection is 
*  completed with a peer Central device. For a GAP Central device, this event is generated as an 
*  acknowledgment of receiving this event successfully by the BLE Controller. 
*
*  This is a non-blocking function. This function must be called after
*  successfully stopping scanning. Scanning is successfully stopped on invoking
*  the Cy_BLE_GAPC_StopDiscovery() function and receiving the event
*  CY_BLE_EVT_GAPC_SCAN_START_STOP with the event data of '0x01',
*  indicating success.
*
*  For details related to connection modes and procedures, refer to Bluetooth
*  4.1 Core Specification, Volume 3, Part C, Section 9.3.
*
*  \param param: Structure of type 'cy_stc_ble_gapc_conn_info_t' that contains the
*              connection parameters.\n
*             <b>Note</b> Any parameter of structure type cy_stc_ble_gapc_conn_info_t,
*             if not required by a specific Bluetooth Low Energy profile, may
*             be ignored.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter for 'param' or if any element within 'param' has an invalid value.
*   CY_BLE_ERROR_INVALID_OPERATION        | Operation is not permitted.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*
*  Note: In multi connection use case, the recommended minimum connection interval per connection should be
*        greater than N * Max Time taken by individual connections to complete a BLE Connection Event (CE).
*        Min_CI = N * Average Time Per CE.
*        Average time for each CE is the amount of time taken to complete one BLE Tx and Rx transaction. This
*        time varies depending on Link Layer Data Length Extension (DLE) and BLE data rate (1 Mbps or 2 Mbps) 
*        configuration. The application can use the below timing lookup table for CE value:
*            1. If DLE is enabled and data rate is 1 Mbps, Average time = 6 ms
*            2. If DLE is enabled and data rate is 2 Mbps, Average time = 3.5 ms
*            3. If DLE is disabled and data rate is 1 Mbps, Average time = 2 ms
*            4. If DLE is disabled and data rate is 2 Mbps, Average time = 1.6 ms
*        For example, if application supports 4 BLE connections with DLE and 1 Mbps data rate, then the recommended
*        minimum connection interval for each of the connections is 4 * 6 = 24 ms.
*        Note that connection intervals less than this value will still work, but under certain circumstances, the
*        real time control procedures (connection update, channel map update, etc.) with shorter update instances might
*        result in link disconnection.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_InitConnection
(
    cy_stc_ble_gapc_conn_info_t  * param
);


