ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gap_central.h
/******************************************************************************
* Function Name: Cy_BLE_GAPC_CancelConnection
***************************************************************************//**
*
* Description:
*  This function cancels a previously initiated connection with the peer device.
*  Operation complete of this API is informed through event 'CY_BLE_EVT_GAP_CREATE_CONN_CANCEL_COMPLETE'
*
*  If the devices are already connected, then this function should not be used.
*  To disconnect from an existing connection, use the function
*  Cy_BLE_GAP_Disconnect().
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                             | Description
*   ------------                             | -----------
*   CY_BLE_SUCCESS                           | On successful operation.
*   CY_BLE_ERROR_INVALID_OPERATION           | Operation is not permitted.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED    | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES      | Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_CancelConnection
(
    void
);


/******************************************************************************
* Function Name: Cy_BLE_GAPC_ResolveDevice
***************************************************************************//**
*
*  This function enables the application to start a resolution procedure for a
*  device that is connected using a resolvable private address. This is a non-blocking function.
*  The application should use this function when in GAP Central mode.
*
*  Refer to Bluetooth 4.1 Core specification, Volume 3, Part C, section 10.8.2.3
*  Resolvable Private Address Resolution Procedure to understand the usage of
*  Private addresses.
* Request complete is informed through 'CY_BLE_EVT_GAP_RESOLVE_DEVICE_COMPLETE'
*
*  \param param: Parameter is of type cy_stc_ble_gapc_resolve_peer_info_t
*   param->bdAddr: Peer Bluetooth device address of length 6 bytes, not
*           NULL terminated.
*   param->peerIrk: 128-bit IRK to be used for resolving the peer's private
*        resolvable address.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter for 'param' or 'bdAddr'.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
*
* Note1: param should point to valid memory location until completion of API
*        is indicated via CY_BLE_EVT_GAP_RESOLVE_DEVICE_COMPLETE event.
* Note2: If using whitelist filtering, update the whitelist
*        with the new address using Cy_BLE_AddDeviceToWhiteList API.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_ResolveDevice
(
    cy_stc_ble_gapc_resolve_peer_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAPC_SetRemoteAddr
***************************************************************************//**
*
*  This function allows the application to set the new address of remote device identified by bdHandle.
*  This API should be used when:
*  1. A peer device is previously bonded with a public address and changes its bd address to a resolvable private address.
*      The application should resolve the device by calling the 'Cy_BLE_GAPC_ResolveDevice()' API and setting the
*      new address if successfully resolved.
*  2. A device is previously bonded with a random, the application should call this API to set the new address(public/random).
*
*  \param param: Parameter of type 'cy_stc_ble_gapc_peer_bd_addr_info_t'
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                         | Description
*   ------------                         | -----------
*   CY_BLE_SUCCESS                       | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER       | On invalid bdHandle.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_SetRemoteAddr
(
    cy_stc_ble_gapc_peer_bd_addr_info_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GAPC_ConnectionParamUpdateRequest
***************************************************************************//**
*
*  This function sends the connection parameter update command to a local controller.
*  This function can be used only from a device connected in the GAP Central role.
*  \note: The connection parameter update procedure, defined as part of Bluetooth spec 4.1, is not supported.
*          This function will allow the GAP Central application to update the connection parameter for a local controller
*          and the local controller will follow the procedure as defined in Bluetooth Core specification 4.0.
* Request complete is informed through 'CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE'
*
*  \param param: Parameter is of type 'cy_stc_ble_gap_conn_update_param_info_t'
*
* \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. Following are the possible error codes.
*
*   Errors codes                          | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL for input parameter.
*   CY_BLE_ERROR_NO_DEVICE_ENTITY         | If connection does not exist for corresponding 'bdHandle'.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Memory allocation failed.
*   CY_BLE_ERROR_INSUFFICIENT_RESOURCES   | Stack resources are unavailable.
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GAPC_ConnectionParamUpdateRequest
(
    cy_stc_ble_gap_conn_update_param_info_t  * param
);

/** @} */

#endif /* CY_BLE_STACK_GAP_CENTRAL_H_ */

/*EOF*/
